<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"d2a4ab7a7455e580ec53d82583beb33e1b3cb66346e81163d2339502621af831","plan_job_ref":"Job Terraform Plan #9 at https://github.com/thetheilred/test-eks/actions/runs/13099174683","plan_hash":"c832016599e4fb9493587388969b8b1ede5d6596701b6636fdc6cb145ab5faa5","plan_text_format":"diff","version":"1.46.1","plan_out_hash":"4e355e7b61eacee68500b27dd330debb2ad57f3b9748e8ff75462bb3850d302b","closed":true} -->
Terraform plan in __terraform/eks__
<details>
<summary>Plan: 34 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_eks_cluster.example will be created
+   resource "aws_eks_cluster" "example" {
+       arn                           = (known after apply)
+       bootstrap_self_managed_addons = true
+       certificate_authority         = (known after apply)
+       cluster_id                    = (known after apply)
+       created_at                    = (known after apply)
+       endpoint                      = (known after apply)
+       id                            = (known after apply)
+       identity                      = (known after apply)
+       name                          = "example"
+       platform_version              = (known after apply)
+       role_arn                      = (known after apply)
+       status                        = (known after apply)
+       tags_all                      = (known after apply)
+       version                       = "1.31"

+       access_config {
+           authentication_mode = "API"
        }

+       kubernetes_network_config (known after apply)

+       upgrade_policy (known after apply)

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = false
+           endpoint_public_access    = true
+           public_access_cidrs       = (known after apply)
+           subnet_ids                = (known after apply)
+           vpc_id                    = (known after apply)
        }
    }

  # aws_iam_role.cluster will be created
+   resource "aws_iam_role" "cluster" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "sts:AssumeRole",
+                           "sts:TagSession",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "eks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "eks-cluster-example"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy will be created
+   resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+       role       = "eks-cluster-example"
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       tags                   = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)

+       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
+       egress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }

+       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
+       ingress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       route                  = (known after apply)
+       tags                   = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       ipam_pool_id         = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1a"
+           "Terraform"   = "true"
        }
+       tags_all             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1a"
+           "Terraform"   = "true"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.nat[1] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       ipam_pool_id         = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1b"
+           "Terraform"   = "true"
        }
+       tags_all             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1b"
+           "Terraform"   = "true"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.nat[2] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       ipam_pool_id         = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1c"
+           "Terraform"   = "true"
        }
+       tags_all             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1c"
+           "Terraform"   = "true"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc"
+           "Terraform"   = "true"
        }
+       tags_all = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc"
+           "Terraform"   = "true"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1a"
+           "Terraform"   = "true"
        }
+       tags_all                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1a"
+           "Terraform"   = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1b"
+           "Terraform"   = "true"
        }
+       tags_all                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1b"
+           "Terraform"   = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[2] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1c"
+           "Terraform"   = "true"
        }
+       tags_all                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1c"
+           "Terraform"   = "true"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1a"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1a"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1b"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1b"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1c"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1c"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1a"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1a"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1b"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1b"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.3.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1c"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1c"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.101.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public-us-east-1a"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public-us-east-1a"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.102.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public-us-east-1b"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public-us-east-1b"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.103.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public-us-east-1c"
+           "Terraform"   = "true"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public-us-east-1c"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc"
+           "Terraform"   = "true"
        }
+       tags_all                             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc"
+           "Terraform"   = "true"
        }
    }

Plan: 34 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform apply #2](https://github.com/thetheilred/test-eks/actions/runs/13099182979)